{
    "cars": [
        {
            "id": 1,
            "name": "Tesla Model S",
            "imagePath": "https://i.ibb.co/2cHW4v6/tesla-model-s.png",
            "description": "This is the highest performing sedan ever built! With the longest range and quickest acceleration of any electric vehicle in production, Model S Plaid is the highest performing sedan ever built. Both Long Range and Plaid powertrains, with updated battery architecture, are capable of back-to-back, consistent 1/4 mile runs.",
            "maxRange": "575 km",
            "zeroToSixty": "1.99 sec",
            "price": 79990,
            "rank" : "#5"
        },
        {
            "id": 2,
            "name": "Porsche Tycan S",
            "imagePath": "https://i.ibb.co/rw44LJn/porsche-tycan-s.png",
            "description": "Best electric Porsche ever made. The Taycan is uncompromising and perfect for the everyday. Striking proportions, timeless and instantly recognisable design. With a spacious interior and two luggage compartments, providing comfort and convenience for four.",
            "maxRange": "323 km",
            "zeroToSixty": "2.6 sec",
            "price": 185000,
            "rank" : "#4"

        },
        {
            "id": 3,
            "name": "Tesla Cybertruck",
            "imagePath": "https://i.ibb.co/ZXfspnS/tesla-cybertruck.png",
            "description": "Versatile utility truck with very high payload capacity and adjustable air suspension. Cybertruck is built with an exterior shell made for ultimate durability and passenger protection. Starting with a nearly impenetrable exoskeleton, every component is designed for superior strength and endurance, from Ultra-Hard 30X Cold-Rolled stainless-steel structural skin to Tesla armor glass.",
            "maxRange": "800 km",
            "zeroToSixty": "2.9 sec",
            "price": 69990,
            "rank" : "#3"

        },
        {
            "id": 4,
            "name": "McLaren 720 S",
            "imagePath": "https://i.ibb.co/4PWd0Hv/mclaeren-720-s.png",
            "description": "Luxurious super car with cutting edge technology. The 720S embodies our relentless quest to push the limits of possibility. Lighter, stronger, faster. It’s all of these and more. But how it makes you feel is altogether something else. Prepare to push the limits of what you thought possible in a supercar.",
            "maxRange": "458 km",
            "zeroToSixty": "2.8 sec",
            "price": 295073,
            "rank" : "#2"

        },
        {
            "id": 5,
            "name": "Tesla Model Y",
            "imagePath": "https://i.ibb.co/DQHdTc9/tesla-model-y.png",
            "description": "A compact electric SUV that got everyting you need. Model Y provides maximum versatility—able to carry 7 passengers and their cargo. Each second row seat folds flat independently, creating flexible storage for skis, furniture, luggage and more. The liftgate opens to a low trunk floor that makes loading and unloading easy and quick",
            "maxRange": "525 km",
            "zeroToSixty": "5.3 sec",
            "price": 60990,
            "rank": "#1"
        }
    ]
}